Conf.Simple/src/Reports/SUI_ОтчетПоВыработкеСотрудников/SUI_ОтчетПоВыработкеСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>SUI_ОтчетПоВыработкеСотрудников</name>
</mdclass:Report>

Conf.Simple/src/InformationRegisters/SUI_docs/SUI_docs.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_docs</name>
  <resources>
    <name>additional_details</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>barcode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>doc_date</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>doc_n</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>doc_type</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_countragents</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_warehouse</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>is_barc_flow</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>use_mark</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтролироватьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоДокументАдресногоХранения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Агрегация</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>process_type</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>cells_process_type</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МобильноеУстройство</name>
    <type>
      <types>CatalogRef.Удалить_SUI_МобильныеКлиенты</types>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.SUI_СостоянияДокументовОбмена</types>
    </type>
  </attributes>
  <dimensions>
    <name>sid</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>id_doc</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НастройкаДокумента</name>
    <type>
      <types>CatalogRef.SUI_НастройкиДокументов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/Reports/SUI_ОтчетПоВыработкеСотрудников/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	ТЗВывод = Новый ТаблицаЗначений;
	ТЗВывод.Колонки.Добавить("Документ");
	ТЗВывод.Колонки.Добавить("Состояние");
	ТЗВывод.Колонки.Добавить("Сотрудник");
	ТЗВывод.Колонки.Добавить("Количество");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ SUI_docs.sid) КАК Количество,
	               |	SUI_docs.id_doc КАК Документ,
	               |	SUI_docs.МобильныйКлиент КАК Сотрудник,
	               |	SUI_docs.Состояние КАК Состояние
	               |ИЗ
	               |	РегистрСведений.SUI_docs КАК SUI_docs
	               |ГДЕ
	               |	SUI_docs.МобильныйКлиент.Наименование <> """"
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	SUI_docs.МобильныйКлиент,
	               |	SUI_docs.Состояние,
	               |	SUI_docs.id_doc";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	
	Для Каждого СтрокаВыгрузки Из ВыборкаДетальныеЗаписи Цикл 
		
		СтруктураПриемник = Новый Структура; 
		
		SUI_ОбщегоНазначенияПереопределяемый.СтрокаТаблицыЗначенийВСтруктуру(СтрокаВыгрузки,СтруктураПриемник);   		
		SUI_ИнтеграцияВКонфигурацию.ВосстановитьСсылкиИдентификаторовSimple(СтруктураПриемник, ,Ложь);  
				
		ЗаполнитьЗначенияСвойств(ТЗВывод.Добавить(), СтруктураПриемник);
		
	КонецЦикла;
		
	Настройки = КомпоновщикНастроек.ПолучитьНастройки(); 
 
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных; 
 
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);	
	
	ВнешнийНаборДанных = Новый Структура("ТаблицаЗначений", ТЗВывод); 
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных; 
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных, ДанныеРасшифровки); 
	
	ДокументРезультат.Очистить();
	
 	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент; 
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат); 
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
